Hi @venkykuberan! Thank you for your response! This solution would not allow our services to continue specifying the app profile they wish to use by app_profile_id. In addition, I believe the Bigtable Instance itself is what needs to have a randomly-generated name, so that when the Instance is deleted by tf and a new one is created, the name changes and the app profiles have parameters that need to be recomputed. I've tested this, and get this `plan` output: 

```

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # google_bigtable_app_profile.dataflow must be replaced
-/+ resource "google_bigtable_app_profile" "dataflow" {
        app_profile_id                = "dataflow"
        description                   = "Application profile for Dataflow jobs"
      ~ id                            = "etsy-aznext-sandbox/arizona-sandbox/dataflow" -> (known after apply)
        ignore_warnings               = false
      ~ instance                      = "arizona-sandbox" -> (known after apply) # forces replacement
      - multi_cluster_routing_use_any = false -> null
      ~ name                          = "projects/etsy-aznext-sandbox/instances/arizona-sandbox/appProfiles/dataflow" -> (known after apply)
      ~ project                       = "etsy-aznext-sandbox" -> (known after apply)

        single_cluster_routing {
            allow_transactional_writes = false
            cluster_id                 = "arizona-sandbox-c1"
        }
    }

  # google_bigtable_app_profile.mmx-slv2 must be replaced
-/+ resource "google_bigtable_app_profile" "mmx-slv2" {
        app_profile_id                = "mmx-slv2"
        description                   = "Application profile for the MMX SLV2 service"
      ~ id                            = "etsy-aznext-sandbox/arizona-sandbox/mmx-slv2" -> (known after apply)
        ignore_warnings               = false
      ~ instance                      = "arizona-sandbox" -> (known after apply) # forces replacement
      - multi_cluster_routing_use_any = false -> null
      ~ name                          = "projects/etsy-aznext-sandbox/instances/arizona-sandbox/appProfiles/mmx-slv2" -> (known after apply)
      ~ project                       = "etsy-aznext-sandbox" -> (known after apply)

        single_cluster_routing {
            allow_transactional_writes = false
            cluster_id                 = "arizona-sandbox-c1"
        }
    }

  # google_bigtable_app_profile.mmx-suggest must be replaced
-/+ resource "google_bigtable_app_profile" "mmx-suggest" {
        app_profile_id                = "mmx-suggest"
        description                   = "Application profile for the MMX Suggest service"
      ~ id                            = "etsy-aznext-sandbox/arizona-sandbox/mmx-suggest" -> (known after apply)
        ignore_warnings               = false
      ~ instance                      = "arizona-sandbox" -> (known after apply) # forces replacement
      - multi_cluster_routing_use_any = false -> null
      ~ name                          = "projects/etsy-aznext-sandbox/instances/arizona-sandbox/appProfiles/mmx-suggest" -> (known after apply)
      ~ project                       = "etsy-aznext-sandbox" -> (known after apply)

        single_cluster_routing {
            allow_transactional_writes = false
            cluster_id                 = "arizona-sandbox-c1"
        }
    }

  # google_bigtable_app_profile.write-throttling must be replaced
-/+ resource "google_bigtable_app_profile" "write-throttling" {
        app_profile_id                = "write-throttling"
        description                   = "Application profile for the write throttling aspect of the shipping pipeline"
      ~ id                            = "etsy-aznext-sandbox/arizona-sandbox/write-throttling" -> (known after apply)
        ignore_warnings               = false
      ~ instance                      = "arizona-sandbox" -> (known after apply) # forces replacement
      - multi_cluster_routing_use_any = false -> null
      ~ name                          = "projects/etsy-aznext-sandbox/instances/arizona-sandbox/appProfiles/write-throttling" -> (known after apply)
      ~ project                       = "etsy-aznext-sandbox" -> (known after apply)

        single_cluster_routing {
            allow_transactional_writes = true
            cluster_id                 = "arizona-sandbox-c1"
        }
    }

  # google_bigtable_instance.arizona-sandbox must be replaced
-/+ resource "google_bigtable_instance" "arizona-sandbox" {
      + cluster_id    = (known after apply)
      ~ display_name  = "arizona-sandbox" -> (known after apply)
      ~ id            = "arizona-sandbox" -> (known after apply)
      ~ instance_type = "PRODUCTION" -> "DEVELOPMENT" # forces replacement
      ~ name          = "arizona-sandbox" -> (known after apply) # forces replacement
      + num_nodes     = (known after apply)
      ~ project       = "etsy-aznext-sandbox" -> (known after apply)
      + storage_type  = (known after apply)
      + zone          = (known after apply)

      ~ cluster {
            cluster_id   = "arizona-sandbox-c1"
          - num_nodes    = 3 -> null
            storage_type = "SSD"
            zone         = "us-central1-c"
        }
      - cluster {
          - cluster_id   = "arizona-sandbox-a1" -> null # forces replacement
          - num_nodes    = 3 -> null
          - storage_type = "SSD" -> null
          - zone         = "us-central1-a" -> null # forces replacement
        }
    }

  # random_string.suffix will be created
  + resource "random_string" "suffix" {
      + id          = (known after apply)
      + length      = 3
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

Plan: 6 to add, 0 to change, 5 to destroy.
```

Which seems to bear this out! `terraform apply` however resulted in this error: `Error: Error reading AppProfile: googleapi: Error 400: Deleting an app profile will cause all requests using it to fail.`
(The app profiles were correctly attempted to be deleted before the instance, but the instance was taking zero requests of any type at the time of `apply`.)

Unfortunately, this solution isn't amazing for systems that don't have service discovery implementations. All of the services that use our Bigtable Instance have a bigtable_instance_id (and app_profile_id) set in a config somewhere, which would need to be updated every time we make this type of terraform change. This doesn't work well for services taking live production traffic (of course, we imagine needing to recreate instances while taking live traffic only in disaster-recovery situations). Our best-case scenario would involve only needing to deploy changes once, in one place, in order to recreate our instance and its app profiles. 

Is there a way in terraform itself to link these resources more closely? In my `terraform plan` output I see `display_name`, `id`,  and `name` all as parameters to the google_bigtable_instance resource. Is it possible to set one of those (if one of them isn't the bigtable_instance_id used by the google bigtable APIs to identify instances) to have a randomly generated value, and link an app profile to it? 